cases/flowPastSphere/OpenFOAM-2506/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    ( -5.0 -5.0 -5.0)
    ( 15.0 -5.0 -5.0)
    ( 15.0  5.0 -5.0)
    ( -5.0  5.0 -5.0)
    ( -5.0 -5.0 5.0)
    ( 15.0 -5.0 5.0)
    ( 15.0  5.0 5.0)
    ( -5.0  5.0 5.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)		//x = -5
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)		//x = 15
        );
    }

    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)		//y = 5
            (1 5 4 0)		//y = -5
            (0 3 2 1)		//z = -5
            (4 5 6 7)		//z = 5
        );
    }
);


// ************************************************************************* //
